In [418]:
from bs4 import BeautifulSoup
import requests
import pandas as pd
from itertools import chain

### Cumulative Grosses Broadway Table

In [186]:
# getting into cumulative grosses for broadway shows
URL = "https://www.broadwayworld.com/grossescumulative.cfm"
r = requests.get(URL) # send the GET request to the URL

In [187]:
soup = BeautifulSoup(r.content, 'html5lib')
table = soup.find('table')
table_body = table.find('tbody')

In [189]:
rows = table_body.find_all('tr') # get all rows from the table

shows_no_title = []
for row in rows:
    # get all data containers in the row
    cols = row.find_all('td')

    # grab all the text for each td in tr
    cols = [ele.span.text.strip() for ele in cols]
    
    # add each row's data to the list
    shows_no_title.append([ele for ele in cols if ele])

In [83]:
shows_no_title_colNames = shows_no_title[0]
shows_no_title_colNames[0] = 'Theatre'
shows_no_title = shows_no_title[1:]

In [84]:
shows_no_title_colNames

['Theatre',
 'Gross',
 'Avg. Tix',
 'SeatsSold',
 'Prev.',
 'RegularShows',
 'TotalPerf.']

In [85]:
shows_title = []
for row in table_body.find_all('tr'):
    # get the show titles from <a> tag in each row
    shows_title.append(row.a.text)

In [420]:
shows_title[:5]

["'NIGHT MOTHER", '110 IN THE SHADE', '13', '1776', '1984']

In [87]:
shows_title_colName = 'Show Title'
shows_title = shows_title[1:]

In [100]:
show_info = pd.DataFrame(shows_no_title)

In [101]:
show_info.head()

           0            1    2        3   4    5    6
0     ROYALE   $2,011,480  $52   38,478  26   65   91
1  STUDIO 54   $5,169,314  $51  102,030  27   94  121
2     JACOBS   $4,436,369  $59   72,907  22  105  127
3   GERSHWIN  $13,667,789  $40  355,683  34  333  367
4     HUDSON   $6,859,821  $61  112,232  38  125  163

In [102]:
# add the titles to the last column
show_info.insert(0, shows_title_colName, shows_title)

In [103]:
show_info.head()

         Show Title          0            1    2        3   4    5    6
0     'NIGHT MOTHER     ROYALE   $2,011,480  $52   38,478  26   65   91
1  110 IN THE SHADE  STUDIO 54   $5,169,314  $51  102,030  27   94  121
2                13     JACOBS   $4,436,369  $59   72,907  22  105  127
3              1776   GERSHWIN  $13,667,789  $40  355,683  34  333  367
4              1984     HUDSON   $6,859,821  $61  112,232  38  125  163

In [104]:
show_info.columns = [shows_title_colName] + shows_no_title_colNames

In [105]:
show_info.head()

,Show Title,Theatre,Gross,Avg. Tix,SeatsSold,Prev.,RegularShows,TotalPerf.
0,'NIGHT MOTHER,ROYALE,"$2,011,480",$52,"38,478",26,65,91
1,110 IN THE SHADE,STUDIO 54,"$5,169,314",$51,"102,030",27,94,121
2,13,JACOBS,"$4,436,369",$59,"72,907",22,105,127
3,1776,GERSHWIN,"$13,667,789",$40,"355,683",34,333,367
4,1984,HUDSON,"$6,859,821",$61,"112,232",38,125,163

In [106]:
for col in ['Gross', 'Avg. Tix', 'SeatsSold', 'Prev.', 'RegularShows', 'TotalPerf.']:
    show_info[col] = show_info[col].str.replace(',', '').str.replace('$', '').astype(int)

In [107]:
show_info.head()

,Show Title,Theatre,Gross,Avg. Tix,SeatsSold,Prev.,RegularShows,TotalPerf.
0,'NIGHT MOTHER,ROYALE,2011480,52,38478,26,65,91
1,110 IN THE SHADE,STUDIO 54,5169314,51,102030,27,94,121
2,13,JACOBS,4436369,59,72907,22,105,127
3,1776,GERSHWIN,13667789,40,355683,34,333,367
4,1984,HUDSON,6859821,61,112232,38,125,163

In [108]:
show_info.dtypes

Show Title      object
Theatre         object
Gross            int64
Avg. Tix         int64
SeatsSold        int64
Prev.            int64
RegularShows     int64
TotalPerf.       int64
dtype: object

In [110]:
# # preliminary processing saved
# show_info.to_csv('gross_broadway_earnings.csv', index=False)

In [411]:
for col in ['Prev.', 'RegularShows', 'TotalPerf.']:
    show_info[col] = show_info[col].astype(int)

In [112]:
show_info = pd.read_csv('gross_broadway_earnings.csv')

In [413]:
show_info.shape

(1270, 8)

In [414]:
show_info.head()

,Show Title,Theatre,Gross,Avg. Tix,SeatsSold,Prev.,RegularShows,TotalPerf.
0,'NIGHT MOTHER,ROYALE,2011480,52,38478,26,65,91
1,110 IN THE SHADE,STUDIO 54,5169314,51,102030,27,94,121
2,13,JACOBS,4436369,59,72907,22,105,127
3,1776,GERSHWIN,13667789,40,355683,34,333,367
4,1984,HUDSON,6859821,61,112232,38,125,163

### Grosses Table

In [502]:
# getting into cumulative grosses for broadway shows
URL = "https://www.broadwayworld.com/grosses.cfm"
r = requests.get(URL) # send the GET request to the URL

soup = BeautifulSoup(r.content, 'html.parser')
# results = soup.find(id="content")

In [503]:
table_body = soup.find("div",attrs={"class":"table-body","id":"grosses-container"})

In [504]:
def process_row(row):
    row_data = []
    
    for ele in row:
        ele_string = str(ele)
        if ele.string:
            entry = ele.string
        else:
            entry = ele.get_text(separator=";")

        if "cell negative" in ele_string:
            entry = "-" + entry
        if entry == '\n':
            continue

        row_data.append(entry)
    
    row_data = [s.split('\n') for s in row_data]
    row_data = list(chain.from_iterable(row_data))
    row_data = [s.split(';') for s in row_data]
    row_data = list(chain.from_iterable(row_data))
    row_data = [s for s in row_data if s != '']
    
    if len(row_data) == 13:
        row_data.insert(10, 0)
    
    return row_data

In [505]:
rows = table_body.find_all("div", attrs={"class":"row"}) # get all rows from the table
gross_table = []

for row in rows:
    row_data = process_row(row)
    gross_table.append(row_data)

In [506]:
len(gross_table)

28

In [507]:
table_header = soup.find("div",attrs={"class":"table-header"})

table_header_lst = ['Show', 'Theater', 'Gross', 'Gross (Prev week)', 'Gross Diff. vs. Prev Week', 
                    'Avg. Ticket', 'Top Ticket', 'Attendance', 'Capacity', 'Perf.', 'Previews', 
                    'Capacity % (This week)', 'Capacity % (Last week)','Diff. %']

In [508]:
recent_gross_df = pd.DataFrame(gross_table)

In [509]:
recent_gross_df.shape

(28, 14)

In [510]:
recent_gross_df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,A STRANGE LOOP,LYCEUM,"$780,492","$854,407","-$73,915",$119.65,$373.00,"6,523","7,296",8,0,89.41%,99.14%,-9.73%
1,ALADDIN,NEW AMSTERDAM,"$1,398,903","$1,379,129","$19,774",$104.32,$227.50,"13,410","13,816",8,0,97.06%,97.97%,-0.91%
2,AMERICAN BUFFALO,CIRCLE IN THE SQUARE,"$556,976","$424,384","$132,592",$106.05,$299.50,"5,252","6,008",8,0,87.42%,78.56%,8.86%
3,BEETLEJUICE,MARQUIS,"$1,056,462","$1,074,541","-$18,078",$116.67,$249.00,"9,055","12,816",8,0,70.65%,73.25%,-2.60%
4,CHICAGO,AMBASSADOR,"$450,294","$536,434","-$86,140",$88.10,$197.00,"5,111","8,640",8,0,59.16%,70.15%,-10.99%

In [511]:
recent_gross_df.columns = table_header_lst

In [512]:
recent_gross_df.head()

,Show,Theater,Gross,Gross (Prev week),Gross Diff. vs. Prev Week,Avg. Ticket,Top Ticket,Attendance,Capacity,Perf.,Previews,Capacity % (This week),Capacity % (Last week),Diff. %
0,A STRANGE LOOP,LYCEUM,"$780,492","$854,407","-$73,915",$119.65,$373.00,"6,523","7,296",8,0,89.41%,99.14%,-9.73%
1,ALADDIN,NEW AMSTERDAM,"$1,398,903","$1,379,129","$19,774",$104.32,$227.50,"13,410","13,816",8,0,97.06%,97.97%,-0.91%
2,AMERICAN BUFFALO,CIRCLE IN THE SQUARE,"$556,976","$424,384","$132,592",$106.05,$299.50,"5,252","6,008",8,0,87.42%,78.56%,8.86%
3,BEETLEJUICE,MARQUIS,"$1,056,462","$1,074,541","-$18,078",$116.67,$249.00,"9,055","12,816",8,0,70.65%,73.25%,-2.60%
4,CHICAGO,AMBASSADOR,"$450,294","$536,434","-$86,140",$88.10,$197.00,"5,111","8,640",8,0,59.16%,70.15%,-10.99%

In [310]:
row.get_text(separator=' ')

'\n ALADDIN \n NEW AMSTERDAM \n $1,379,129 \n $1,355,330 \n $23,799 \n $101.89 $199.50 \n 13,536 13,816 \n 8 \n 97.97% \n 98.23% \n 0.26% \n'

In [498]:
row = rows[1]
row_data = []
for ele in row:
    ele_string = str(ele)
    if ele.string:
        entry = ele.string
#         print(ele.string)
    else:
        entry = ele.get_text(separator=";")
#         print(ele.get_text(separator=","))
    
    if "cell negative" in ele_string:
        entry = "-" + entry
    if entry == '\n':
        continue
#     print(entry)
    row_data.append(entry)
#     print(len(row_data))

In [499]:
row_data

['ALADDIN;\n;NEW AMSTERDAM',
 '$1,379,129',
 '$1,355,330',
 '$23,799',
 '$101.89;$199.50',
 '13,536;13,816',
 '8',
 '97.97%',
 '98.23%',
 '-0.26%']

In [500]:
row_data = [s.split('\n') for s in row_data]
row_data = list(chain.from_iterable(row_data))
row_data = [s.split(';') for s in row_data]
row_data = list(chain.from_iterable(row_data))
row_data = [s for s in row_data if s != '']
row_data

['ALADDIN',
 'NEW AMSTERDAM',
 '$1,379,129',
 '$1,355,330',
 '$23,799',
 '$101.89',
 '$199.50',
 '13,536',
 '13,816',
 '8',
 '97.97%',
 '98.23%',
 '-0.26%']

In [501]:
len(row_data)

13

In [496]:
row_data.insert(10, 0)

In [497]:
row_data

['ALADDIN',
 'NEW AMSTERDAM',
 '$1,379,129',
 '$1,355,330',
 '$23,799',
 '$101.89',
 '$199.50',
 '13,536',
 '13,816',
 '8',
 0,
 '97.97%',
 '98.23%',
 '-0.26%']

In [435]:
from itertools import chain
row_data = [s.split(' ') for s in row_data]
row_data = list(chain.from_iterable(row_data))
row_data = [s for s in row_data if s != '\n']
row_data

['ALADDIN',
 'NEW',
 'AMSTERDAM',
 '$1,379,129',
 '$1,355,330',
 '$23,799',
 '$101.89',
 '$199.50',
 '13,536',
 '13,816',
 '8',
 '97.97%',
 '98.23%',
 '-0.26%']

In [382]:
table_header = soup.find("div",attrs={"class":"table-header"})

In [383]:
table_header

<div class="table-header">
<div class="row">
<div class="cell" data-order="1" data-sort="name"><span class="sort"><b>Show</b><b>Theater</b></span></div>
<div class="cell" data-sort="gross"><span class="sort"><b>Gross</b><b></b></span></div>
<div class="cell" data-sort="gross-prev"><span class="sort"><b>Gross</b><b>Prev week</b></span></div>
<div class="cell" data-sort="gross-diff-year"><span class="sort"><b>Gross Diff.</b><b>vs. Prev Week</b></span></div>
<div class="cell" data-sort="ticket"><span class="sort"><b>Avg. Ticket</b><b>Top Ticket</b></span></div>
<div class="cell" data-sort="attendee"><span class="sort"><b>Attendance</b> <b>Capacity</b></span></div>
<div class="cell" data-sort="perform"><span class="sort"><b>Perf.</b> <b>Previews</b></span></div>
<div class="cell" data-sort="capacity"><span class="sort"><b>Capacity %</b><b>This week</b></span></div>
<div class="cell" data-sort="capacity-last"><span class="sort"><b>Capacity %</b><b>Last week</b></span></div>
<div class="cell" data-sort="diff-percents"><span class="sort"><b>Diff. %</b> </span></div>
</div>
</div>

In [404]:
test = table_header_lst.split('\n')
test = [s.replace(',', ' ') for s in test]
test = [s for s in test if (not s.isspace()) and (s != '')]
test

[' Show Theater ',
 ' Gross ',
 ' Gross Prev week ',
 ' Gross Diff. vs. Prev Week ',
 ' Avg. Ticket Top Ticket ',
 ' Attendance   Capacity ',
 ' Perf.   Previews ',
 ' Capacity % This week ',
 ' Capacity % Last week ',
 ' Diff. %   ']

In [407]:
table_header_lst = ['Show', 'Theater', 'Gross', 'Gross (Prev week)', 'Gross Diff. vs. Prev Week', 
                    'Avg. Ticket', 'Top Ticket', 'Attendance', 'Capacity', 'Perf. Previews', 
                    'Capacity % (This week)', 'Capacity % (Last week)','Diff. %']
table_header_lst

['Show',
 'Theater',
 'Gross',
 'Gross (Prev week)',
 'Gross Diff. vs. Prev Week',
 'Avg. Ticket',
 'Top Ticket',
 'Attendance',
 'Capacity',
 'Perf. Previews',
 'Capacity % (This week)',
 'Capacity % (Last week)',
 'Diff. %']

In [408]:
len(table_header_lst), len(row_data)

(13, 13)